#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/Colin-Loh/azure_blog_github_actions/runs/run-aGNcD6SydmsPTMTu

Waiting for the plan to start...

Terraform v1.4.6
on linux_amd64
Initializing plugins and modules...
random_pet.name: Refreshing state... [id=foal]
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/2f3af910-c692-4fb4-a3b3-e4cf832f6348/resourceGroups/foal-rg]
azurerm_static_site.webapp: Refreshing state... [id=/subscriptions/2f3af910-c692-4fb4-a3b3-e4cf832f6348/resourceGroups/foal-rg/providers/Microsoft.Web/staticSites/foal-website]
github_actions_secret.webapp_api_token: Refreshing state... [id=personal-blog:AZURE_STATIC_WEB_APPS_API_TOKEN]
azurerm_static_site.webapp: Drift detected (update)
github_actions_secret.webapp_api_token: Drift detected (delete)
azurerm_resource_group.rg: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_actions_secret.webapp_api_token will be created
  + resource "github_actions_secret" "webapp_api_token" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "personal-blog"
      + secret_name     = "AZURE_STATIC_WEB_APPS_API_TOKEN"
      + updated_at      = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 2 estimated
           $0.0/mo +$0.0

```

</details>

*Pusher: @Colin-Loh, Action: `pull_request`*